Revit 2026 API

# Transform2DAssign Method

---

Assigns values from the input transformation to this transformation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Assign(
	Transform2D from
)
```
```vb
Public Sub Assign (
	from As Transform2D
)
```
```cpp
public:
void Assign(
	Transform2D^ from
)
```
```fsharp
member Assign :
        from : Transform2D -> unit
```

#### Parameters

from Transform2D
     The transformation to use as input.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Transform2D Class

Autodesk.Revit.DB Namespace